In [1]:
import pandas as pd

In [8]:
data = {
    'isim': ['Ali', 'Veli', 'Ayşe', 'Fatma'],
    'yaş': [24, 22, 28, 30],
    'şehir': ['İstanbul', 'Ankara', 'İstanbul', 'Bursa'],
    'maaş': [17000,9000,22000,25000]
}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

    isim  yaş     şehir   maaş
0    Ali   24  İstanbul  17000
1   Veli   22    Ankara   9000
2   Ayşe   28  İstanbul  22000
3  Fatma   30     Bursa  25000

## Sütun ekleme

In [28]:
df["eğlence"] = (df["maaş"] /4).round()
df["faturalar"] = (df["maaş"] /2.5).round()

In [35]:
df["kalan para"] = df["maaş"] - (df["eğlence"] + df["faturalar"])

In [36]:
df

    isim  yaş     şehir   maaş  eğlence  faturalar  kalan para
0    Ali   24  İstanbul  17000   4250.0     6800.0      5950.0
1   Veli   22    Ankara   9000   2250.0     3600.0      3150.0
2   Ayşe   28  İstanbul  22000   5500.0     8800.0      7700.0
3  Fatma   30     Bursa  25000   6250.0    10000.0      8750.0

## Sütun silme

In [37]:
#df.drop("eğlence masrafı", axis = 1, inplace = True)

In [33]:
df.drop("kira masrafı", axis = 1, inplace = True)

In [38]:
df

    isim  yaş     şehir   maaş  eğlence  faturalar  kalan para
0    Ali   24  İstanbul  17000   4250.0     6800.0      5950.0
1   Veli   22    Ankara   9000   2250.0     3600.0      3150.0
2   Ayşe   28  İstanbul  22000   5500.0     8800.0      7700.0
3  Fatma   30     Bursa  25000   6250.0    10000.0      8750.0

In [39]:
df[df["kalan para"] > 6000]

    isim  yaş     şehir   maaş  eğlence  faturalar  kalan para
2   Ayşe   28  İstanbul  22000   5500.0     8800.0      7700.0
3  Fatma   30     Bursa  25000   6250.0    10000.0      8750.0